case_coarse/0.orig/initialPressureProfile
pressureProfile
nonuniform List<scalar>
262144
(
0.000259628
-2.60517
-3.60066
-1.99752
-0.688042
-0.203564
0.050401
-0.601861
...
);
