case_coarse/0.orig/initialVelocityProfile
velocityProfile
nonuniform List<vector>
262144
(
(0.887037 -0.000861337 0.174992)
(0.733328 0.00248443 0.123856)
(0.471579 0.00145997 0.0841005)
(0.550978 0.000284588 0.0531736)
(0.711889 0.000628113 -0.0129682)
(0.960515 0.00020436 -0.106469)
(1.24369 6.07925e-05 0.0604072)
(1.16814 0.000289487 0.241458)
...
);
