case_coarse/0.orig/initialViscosityProfile
nutProfile
nonuniform List<scalar>
262144
(
1.17507e-09
1.32123e-09
2.09127e-12
4.18888e-10
4.31184e-09
7.77538e-10
1.68339e-10
6.28048e-13
...
);
